# 1.task
# Создайте массив из чисел от 1 до 10. Увеличьте каждое число на 3 и выведите результат.
arr = np.arange(1, 11)
arr = arr + 3
print(arr)

# 2.task
# Создайте массив из трех строк по 5 нулей. Измените элемент во втором ряду и третьем столбце на 7.
arr = np.zeros((3, 5))
arr[1, 2] = 7
print(arr)

# 3.task

# 4.task

# 5.task

# 6.task

# 7.task

# 8.task

# 9.task

# 10.task

# 11.task

# 12.task

# 13.task

# 14.task

# 15.task
