# 1.task
# Создайте одномерный массив из чисел от 1 до 10 включительно. Выведите его размерность, форму и тип данных.
arr = np.arange(1, 11)
print(arr.ndim, arr.shape, arr.dtype)

# 2.task
# Добавьте в массив [1, 2, 3] элементы [6, 7, 8] и выведите результат.
arr = np.array([1, 2, 3])
arr = np.append(arr, [6, 7, 8])
print(arr)

# 3.task

# 4.task

# 5.task

# 6.task

# 7.task

# 8.task

# 9.task

# 10.task

# 11.task

# 12.task

# 13.task

# 14.task

# 15.task
